/** @format */

interface Items {
  category: string
  brands: string[] | subOption[]
}
interface subOption {
  brand: string
  products: string[]
}

export const items: Items[] = [
  {
    category: 'شیرینی خشک',
    brands: [
      'گل محمدی',
      'کیک یزدی',
      'شیرینی زبان',
      'شیرینی نخود چی ',
      'شیرینی مشهدی',
      'شیرینی پاپیونی',
      'شیرینی میکادو',
      'شیرینی کشمشی',
    ],
  },

  {
    category: 'شیرینی تر',
    brands: [
      'شیرینی لطیفه',
      'شیرینی رولت',
      'نان خامه ای',
      'شیرینی ناپلئونی',
      'شیرینی زبان',
      'شیرینی مربایی',
    ],
  },

  {
    category: 'کیک',
    brands: [
      'زیر مجموعه کیک میشه',
      'ولنتاین',
      'بارداری',
      'پسرانه',
      'دخترانه',
      'فارغ التحصیلی',
      'مردانه',
      'تعیین جنسیت',
      'دندونی',
      'نامزدی',
      'عروسی',
      'چند طبقه',
      'کارتونی',
      'هالووین',
      'کارتونی',
      'سه بعدی',
      'مشاغل',
    ],
  },
]
