/** @format */

export interface Items {
  name: string
  link?: string
  category?: Category[]
}
interface Category {
  name: string
  type?: string[]
}

export const items: Items[] = [
  { name: 'صفحه اصلی', link: '/' },
  { name: 'درباره ما', link: '/about-us' },
  { name: 'کیک سفارشی', link: '/custom-cake' },
  {
    name: 'فروشگاه',
    link: '/Store',
    category: [
      {
        name: 'شیرینی خشک',
        type: [
          'گل محمدی',
          'کیک یزدی',
          'شیرینی زبان',
          'شیرینی نخود چی ',
          'شیرینی مشهدی',
          'شیرینی پاپیونی',
          'شیرینی میکادو',
          'شیرینی کشمشی',
        ],
      },
      {
        name: 'شیرینی تر',
        type: [
          'شیرینی لطیفه',
          'شیرینی رولت',
          'نان خامه ای',
          'شیرینی ناپلئونی',
          'شیرینی زبان',
          'شیرینی مربایی',
        ],
      },

      {
        name: 'کیک',
        type: [
          'ولنتاین',
          'بارداری',
          'پسرانه',
          'دخترانه',
          'فارغ التحصیلی',
          'مردانه',
          'تعیین جنسیت',
          'دندونی',
          'نامزدی',
          'عروسی',
          'چند طبقه',
          'کارتونی',
          'هالووین',
          'کارتونی',
          'سه بعدی',
          'مشاغل',
        ],
      },
    ],
  },
  { name: 'تماس با ما', link: '/contact-us' },
]
