/** @format */

interface Items {
  category: string
  brands: string[] | subOption[]
}
interface subOption {
  brand: string
  products: string[]
}

export const items: Items[] = [
  {
    category: "کیک تولد",
    brands: ["فانتزی", "چند طبقه", "چاپ تصویر", "پسرانه", "دخترانه"],
  },

  {
    category: "کیک نامزدی",
    brands: ["فانتزی", "چند طبقه", "چاپ تصویر"],
  },

  {
    category: "کیک تعیین جنسیت",
    brands: ["فانتزی", "چند طبقه", "چاپ تصویر", "پسرانه", "دخترانه"],
  },

  {
    category: "کیک مناسبتی",
    brands: [
      {
        brand: "شکل",
        products: [
          "کیک فوری",
          "مینی کیک",
          "قلب سوپرایزی",
          "کیک تصویری",
          "کیک کارتونی",
          "کیک مشاغل",
          "کیک اعداد ",
          "کیک حروف",
          "کیک یکسالگی",
          "کیک ورزشی",
          "مینی کیک ولنتاین",
          "کیک پروانه ای",
          "شمع تولد",
        ],
      },
      {
        brand: "نوع",
        products: [
          "کیک سالگرد ازدواج",
          "کیک دندونی",
          "کیک بارداری و نوزادی",
          "کیک جشن الفبا",
          "کیک فارغ التحصیلی",
          "کیک هالووین",
          "کیک پایان خدمت",
        ],
      },
      {
        brand: "روز",
        products: [          "کیک ولنتاین",
        "کیک یلدا",
        "کیک روز مادر",
        "کیک روز پدر",
        "کیک روز دختر",
        "کیک روز پسر",
        "کیک روز معلم",
        "کیک روز پزشک",
        "کیک روز پرستار",
        "کیک روز مهندس",
        "کیک روز حسابدار",
        "کیک روز عکاس",
        "کیک روز دندانپزشک",
],
      },
    ],
  },
]
